//------------------------------------------------------------------------
// NAME: Simeon Tsekov
// CLASS: XIa
// NUMBER: 24
// PROBLEM: #1
// FILE NAME: strlen.c
// FILE PURPOSE:
// целта на файлът е да определи дължината на определен символен низ
//------------------------------------------------------------------------

#include <stdio.h>
#include <stdlib.h>

size_t strlen(const char *a);

int main(){
	char a[5] = {'a', 'b', 'c', 'd', '\0'}; 
	printf("%zu\n", strlen(a));	
	
	return 0;
}

//------------------------------------------------------------------------
// FUNCTION: strlen
// връща дължината на символен низ
// PARAMETERS:
// const char *a - указател към низа, на който трябва да се определи дължината
//------------------------------------------------------------------------

size_t strlen(const char *a){
	int i;
	for(i=0; a[i]!='\0'; i++);
	
	return i;
}
