//------------------------------------------------------------------------
// NAME: Simeon Tsekov
// CLASS: XIa
// NUMBER: 24
// PROBLEM: #3
// FILE NAME: swap.c
// FILE PURPOSE:
// фаилът разменя стойностите на две числа
//------------------------------------------------------------------------

#include <stdio.h>
#include <stdlib.h>

void swap(int *a, int *b);

int main(){
	int a = 4;
	int b = 8;

	swap(&a, &b);
	printf("%d %d\n", a, b);

	return 0;
}

//------------------------------------------------------------------------
// FUNCTION: swap
// сменя стойностите на две числа
// PARAMETERS:
// *a, *b - указатели към числата, чиито стойности да бъдат сменени
//------------------------------------------------------------------------

void swap(int *a, int *b){
	int temp;

	temp = *a;
	*a = *b;
	*b = temp;
}
